Repository: TableProApp/TablePro
Catalog: TablePro/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ko, tr, vi, zh_hans, zh_hant

source: Syncing with iCloud…
fr: Synchronisation avec iCloud...
ko: iCloud와 동기화 중…
tr: iCloud ile eşitleniyor…
vi: Đang đồng bộ với iCloud…
zh_hans: 正在与 iCloud 同步…
zh_hant: 正在與 iCloud 同步…

source: %@ Query
fr: %@ Requête
ko: %@ 쿼리
tr: %@ Sorgusu
vi: Truy vấn %@
zh_hans: %@ 查询
zh_hant: %@ 查詢

source: This value is %@. The source is still readable.
fr: Cette valeur est %@. La source est toujours lisible.

source: Ran %@ statement
fr: Exécution de l'instruction %@
ko: %@ 명령문 실행됨
tr: %@ ifade çalıştırıldı
vi: Đã chạy %@ câu lệnh
zh_hans: 已运行 %@ 条语句
zh_hant: 已執行 %@ 條陳述式

source: Inherited automatically.
fr: Hérité automatiquement.
ko: 자동으로 상속됨.
tr: Otomatik olarak devralındı.
vi: Được kế thừa tự động.
zh_hans: 自动继承。
zh_hant: 自動繼承。

source: Inline Suggestions
fr: Suggestions en ligne
ko: 인라인 제안
tr: Satır İçi Öneriler
vi: Gợi ý nội tuyến
zh_hans: 行内建议
zh_hant: 行內建議

source: Highlight current statement
fr: Souligner l'état actuel
ko: 현재 문 강조
tr: Mevcut ifadeyi vurgula
vi: Đánh dấu câu lệnh hiện tại
zh_hans: 高亮当前语句
zh_hant: 標示目前陳述式

source: %@ cannot be negative
fr: %@ ne peut pas être négatif
ko: %@ 값은 음수일 수 없습니다
tr: %@ cannot be negatif
vi: %@ không được là số âm
zh_hans: %@ 不能为负数
zh_hant: %@ 不能為負數

source: Filter by Tag
fr: Filtrer par étiquette

# Connection "%@" has a script that will run before connecting: %@
source: Connection "%1$@" has a script that will run before connecting: %2$@
fr: La connexion "%1$@" a un script qui sera exécuté avant la connexion : %2$@
ko: 연결 "%1$@"에는 연결 전에 실행될 스크립트가 있습니다: %2$@
tr: "%@" bağlantısının bağlanmadan önce çalışacak bir betiği var: %@
vi: Kết nối "%@" có một script sẽ chạy trước khi kết nối: %@
zh_hans: 连接"%@"有一个将在连接前运行的脚本： %@
zh_hant: 連線「%1$@」有一個將在連線前執行的指令碼： %2$@

source: Read rows from a table with filters, sorting and paging, built by TablePro's own query builder for this engine. Prefer it over hand-writing SELECT: it quotes identifiers, escapes values, and pages the way the app does.
fr: Lisez des lignes d'une table avec des filtres, un tri et une pagination, construits par le propre constructeur de requêtes de TablePro pour ce moteur. Préférez-le au choix manuel de SELECT : il entre les identifiants entre guillemets, évite les valeurs et parcourt les pages comme l'application le fait.
ko: 이 엔진용 TablePro 자체 쿼리 빌더가 만든 필터, 정렬, 페이징으로 테이블의 행을 읽습니다. SELECT를 직접 작성하는 대신 이것을 사용하십시오. 식별자를 인용하고 값을 이스케이프하며 앱과 동일한 방식으로 페이징합니다.
tr: Bu motor için TablePro'nun kendi sorgu oluşturucusunun ürettiği filtreler, sıralama ve sayfalama ile bir tablodan satır okur. SELECT'i elle yazmak yerine bunu tercih edin: tanımlayıcıları tırnaklar, değerleri kaçışlar ve uygulamanın yaptığı gibi sayfalar.
vi: Đọc các dòng từ một bảng với bộ lọc, sắp xếp và phân trang, do chính query builder của TablePro dựng cho engine này. Hãy ưu tiên nó thay vì tự viết SELECT: nó trích dẫn định danh, escape giá trị và phân trang đúng như ứng dụng làm.
zh_hans: 从表中读取行，带有筛选、排序和分页，由 TablePro 自己针对该引擎的查询构建器生成。请优先用它而不是手写 SELECT：它会为标识符加引号、转义值，并采用与应用相同的分页方式。
zh_hant: 從資料表中讀取列，帶有篩選、排序和分頁，由 TablePro 自己針對該引擎的查詢建構器產生。請優先用它而不是手寫 SELECT：它會為識別符號加引號、跳脫值，並採用與應用程式相同的分頁方式。

source: Select Model
fr: Sélectionner le modèle
ko: 모델 선택
tr: Model Seç
vi: Chọn mô hình
zh_hans: 选择模型
zh_hant: 選擇模型

source: Moving through this tab's history replaces what it is showing and will discard all unsaved changes.
fr: Le déplacement dans l'historique de cette onglet remplace ce qu'il affiche et rejette toutes les modifications non enregistrées.

source: Table name
fr: Nom de la table
ko: 테이블 이름
tr: Tablo adı
vi: Tên bảng
zh_hans: 表名
zh_hant: 資料表名稱

source: Remove Field
fr: Supprimer le champ

source: Select %@ file to import
fr: Sélectionnez le fichier %@ à importer
ko: 가져올 %@ 파일 선택
tr: İçe aktarılacak %@ dosyasını seçin
vi: Chọn file %@ để nhập
zh_hans: 选择要导入的 %@ 文件
zh_hant: 選擇要匯入的 %@ 檔案

source: Zero Fill
fr: Remplissage zéro
ko: 0 채우기
tr: Sıfırla Doldur
vi: Điền số 0
zh_hans: 零填充
zh_hant: 零填補

source: Private Key
fr: Clé privée
ko: 개인 키
tr: Özel Anahtar
vi: Khóa riêng tư
zh_hans: 私钥
zh_hant: 私鑰

source: Switch First Row Between Header/Data
fr: Changer la première ligne entre la ligne de tête/les données
ko: 첫 번째 행을 머리글/데이터 간에 전환
tr: İlk Satırı Başlık/Veri Arasında Değiştir
vi: Chuyển dòng đầu giữa tiêu đề và dữ liệu
zh_hans: 将首行在表头与数据之间切换
zh_hant: 將首列在標題與資料之間切換

source: 1 connection
fr: 1 connexion

source: View Elements…
fr: Voir les éléments...

source: Start recording queries again
fr: Commencez à enregistrer à nouveau les requêtes.
ko: 쿼리 기록 재개
tr: Sorguları yeniden kaydetmeye başla
vi: Bắt đầu ghi lại truy vấn
zh_hans: 重新开始记录查询
zh_hant: 重新開始記錄查詢

source: TablePro's Safe Mode is set to read-only for this connection. Set it to Confirm Writes or higher to allow this tool.
fr: Le mode sécurisé de TablePro est réglé sur lecture seule pour cette connexion. Réglez-le sur Confirmer les écritures ou plus haut pour autoriser cet outil.
ko: 이 연결에서는 TablePro의 안전 모드가 읽기 전용으로 설정되어 있습니다. 이 도구를 허용하려면 쓰기 확인 이상으로 설정하십시오.
tr: Bu bağlantı için TablePro'nun Safe Mode ayarı salt okunur. Bu araca izin vermek için Confirm Writes veya daha üstünü seçin.
vi: Chế độ an toàn của TablePro đang đặt kết nối này ở chế độ chỉ đọc. Đặt thành Confirm Writes hoặc cao hơn để cho phép công cụ này.
zh_hans: TablePro 的安全模式已将此连接设为只读。请设为 Confirm Writes 或更高级别以允许此工具。
zh_hant: TablePro 的安全模式已將此連線設為唯讀。請設為 Confirm Writes 或更高層級以允許此工具。

source: A server on another machine has to be HTTPS.
fr: Un serveur sur une autre machine doit être HTTPS.

source: Cannot Read This Connection
fr: Impossible de lire cette connexion
ko: 이 연결을 읽을 수 없음
tr: Bu Bağlantı Okunamıyor
vi: Không đọc được kết nối này
zh_hans: 无法读取此连接
zh_hant: 無法讀取此連線

source: Create Table
fr: Créer une table
ko: 테이블 생성
tr: Tablo Oluştur
vi: Tạo bảng
zh_hans: 创建表
zh_hant: 建立資料表

source: %1$@ (runs on the outside MCP server %2$@)
fr: %1$@ (fonctionne sur le serveur MCP externe %2$@)

source: Add Provider
fr: Ajouter fournisseur
ko: 프로바이더 추가
tr: Sağlayıcı Ekle
vi: Thêm nhà cung cấp
zh_hans: 添加提供商
zh_hant: 新增供應商

source: Type %@ in the query to set where the cursor lands after keyword expansion.
fr: Tapez %@ dans la requête pour définir où le curseur atterrit après l'expansion du mot-clé.
ko: 키워드 확장 후 커서가 놓일 위치를 지정하려면 쿼리에 %@을(를) 입력하십시오.
tr: İmlecin anahtar kelime genişletmesinden sonra nereye geleceğini belirlemek için sorguya %@ yazın.
vi: Gõ %@ trong truy vấn để chỉ định vị trí con trỏ sau khi từ khóa được mở rộng.
zh_hans: 在查询中输入 %@，用于指定关键字展开后光标停留的位置。
zh_hant: 在查詢中輸入 %@，用來指定關鍵字展開後游標停留的位置。

source: Do you want to save changes?
fr: Voulez-vous enregistrer les modifications ?
ko: 변경 사항을 저장하시겠습니까?
tr: Değişiklikleri kaydetmek istiyor musunuz?
vi: Bạn có muốn lưu thay đổi?
zh_hans: 是否保存更改?
zh_hant: 是否要儲存變更？

source: Line %@ holds binary data that cannot be read back exactly from a %@ file. Export the dump with --hex-blob, then import it again.
fr: La ligne %@ contient des données binaires qui ne peuvent pas être lues exactement à partir d'un fichier %@. Exportez le dump avec --hex-blob, puis importez-le à nouveau.

source: Local only - not synced to iCloud
fr: Seulement local - pas synchronisé avec iCloud
ko: 로컬 전용 - iCloud에 동기화되지 않음
tr: Sadece yerel - iCloud ile eşitlenmiyor
vi: Chỉ cục bộ - không đồng bộ lên iCloud
zh_hans: 仅本地 - 不同步到 iCloud
zh_hant: 僅限本機，不同步至 iCloud

source: Uptime
fr: Temps d'activité
ko: 가동 시간
tr: Çalışma Süresi
vi: Thời gian hoạt động
zh_hans: 运行时间
zh_hant: 運作時間

source: NULL, no referenced row
fr: NULL, aucune ligne référencée
ko: NULL, 참조된 행 없음
tr: NULL, başvurulan satır yok
vi: NULL, không có hàng được tham chiếu
zh_hans: NULL，没有被引用的行
zh_hant: NULL，沒有被參照的列

source: Data grid
fr: Grille de données
ko: 데이터 그리드
tr: Veri tablosu
vi: Lưới dữ liệu
zh_hans: 数据网格
zh_hant: 資料格

source: Export %d Connections...
fr: Exporter %d connexions...
ko: 연결 %d개 내보내기...
tr: %d Bağlantıyı Dışa Aktar...
vi: Xuất %d kết nối...
zh_hans: 导出%d个连接...
zh_hant: 匯出 %d 個連線…

source: is empty
fr: Est vide
ko: 비어 있음
tr: boş
vi: trống
zh_hans: 为空
zh_hant: 為空

source: %lld statement had already run and stays committed.
fr: La déclaration %lld avait déjà été exécutée et reste engagée.

source: Show Toolbar
fr: Afficher la barre d'outils
ko: 도구 막대 보기
tr: Araç Çubuğunu Göster
vi: Hiện thanh công cụ
zh_hans: 显示工具栏
zh_hant: 顯示工具列

source: Truncate table '%@'
fr: Truncation de la table '%@'
ko: '%@' 테이블 비우기
tr: Truncate tablo '%@'
vi: Làm trống bảng '%@'
zh_hans: 清空表 '%@'
zh_hant: 清空資料表 '%@'

source: Query failed. %@
fr: La requête a échoué. %@
ko: 쿼리에 실패했습니다. %@
tr: Sorgu başarısız oldu. %@
vi: Truy vấn thất bại. %@
zh_hans: 查询失败。%@
zh_hant: 查詢失敗。%@

source: Slowest
fr: Le plus lent
ko: 가장 느림
tr: En Yavaş
vi: Chậm nhất
zh_hans: 最慢
zh_hant: 最慢

source: List Session Contexts
fr: Liste des contextes de session
ko: 세션 컨텍스트 목록
tr: Oturum Bağlamlarını Listele
vi: Liệt kê context phiên
zh_hans: 列出会话上下文
zh_hant: 列出工作階段情境

source: Cloud SQL Auth Proxy disconnected. Click to reconnect.
fr: Cloud SQL Auth Proxy déconnecté. Cliquez pour vous reconnecter.
ko: Cloud SQL Auth Proxy의 연결이 끊어졌습니다. 클릭하여 다시 연결하십시오.
tr: Cloud SQL Auth Proxy bağlantısı kesildi. Yeniden bağlanmak için tıklayın.
vi: Cloud SQL Auth Proxy đã ngắt kết nối. Nhấn để kết nối lại.
zh_hans: Cloud SQL Auth Proxy 已断开。点按可重新连接。
zh_hant: Cloud SQL Auth Proxy 已中斷連線。點按即可重新連線。

source: Theme:
fr: Thème :
ko: 테마:
tr: Tema:
vi: Giao diện:
zh_hans: 主题：
zh_hant: 佈景主題：

# %lld of %lld selected
source: %1$lld of %2$lld selected
fr: %1$lld de %2$lld sélectionné
ko: %1$lld/%2$lld개 선택됨
tr: %lld / %lld seçili
vi: %lld / %lld đã chọn
zh_hans: 已选择 %lld / %lld
zh_hant: 已選取 %1$lld / %2$lld

source: Close Result
fr: Fermer le résultat

source: Attribute label
fr: Étiquette d'attribut
ko: 속성 레이블
tr: Öznitelik etiketi
vi: Nhãn thuộc tính
zh_hans: 属性标签
zh_hant: 屬性標籤

source: The table needs at least one column with a name and a type.
fr: La table doit avoir au moins une colonne avec un nom et un type.

source: Choose Folder
fr: Choisissez le dossier
ko: 폴더 선택
tr: Klasör Seç
vi: Chọn thư mục
zh_hans: 选择文件夹
zh_hant: 選擇資料夾

source: 90 days
fr: 90 jours
ko: 90일
tr: 90 gün
vi: 90 ngày
zh_hans: 90 天
zh_hant: 90 天

source: Cloud data warehouse
fr: Stockage de données en nuage
ko: 클라우드 데이터 웨어하우스
tr: Bulut veri ambarı
vi: Kho dữ liệu đám mây
zh_hans: 云数据仓库
zh_hant: 雲端資料倉儲

source: MCP Configuration
fr: Configuration MCP
ko: MCP 구성
tr: MCP Yapılandırması
vi: Cấu hình MCP
zh_hans: MCP 配置
zh_hant: MCP 設定

source: Outside MCP Servers
fr: Hors des serveurs MCP

source: This license was issued for a different Mac.
fr: Cette licence a été délivrée pour un Mac différent.
ko: 이 라이선스는 다른 Mac용으로 발급되었습니다.
tr: Bu lisans başka bir Mac için verildi.
vi: Giấy phép này được cấp cho một máy Mac khác.
zh_hans: 此许可证是为另一台 Mac 签发的。
zh_hant: 此授權是為另一台 Mac 簽發的。

source: Custom Path
fr: Chemin personnalisé
ko: 사용자 지정 경로
tr: Özel Yol
vi: Đường dẫn tùy chỉnh
zh_hans: 自定义路径
zh_hant: 自訂路徑

source: Size All Columns to Fit
fr: Taille toutes les colonnes pour s'adapter
ko: 모든 열을 내용에 맞게 조절
tr: Tüm Sütunları Sığdır
vi: Tự điều chỉnh tất cả cột
zh_hans: 自动调整所有列宽
zh_hant: 自動調整所有欄位寬度

source: The .bacpac always carries the whole schema. Only the chosen tables' data is narrowed, and tables they reference by foreign key have to be chosen too.
fr: Le .bacpac contient toujours tout le schéma. Seuls les données des tables choisies sont réduites, et les tables qu'elles renvoient par clé étrangère doivent également être choisies.

source: The source returned an empty definition.
fr: La source a renvoyé une définition vide.

source: The license that covers iCloud Sync has expired. Renew it to start syncing again.
fr: La licence qui couvre iCloud Sync a expiré. Rénouvelez-la pour reprendre la synchronisation.
ko: iCloud 동기화를 포함하는 라이선스가 만료되었습니다. 다시 동기화하려면 갱신하십시오.
tr: iCloud Eşitleme'yi kapsayan lisansın süresi doldu. Yeniden eşitlemeye başlamak için yenileyin.
vi: Giấy phép bao gồm Đồng bộ iCloud đã hết hạn. Hãy gia hạn để đồng bộ trở lại.
zh_hans: 涵盖 iCloud 同步的许可证已过期。续订后即可再次同步。
zh_hant: 涵蓋 iCloud 同步的授權已過期。續訂後即可再次同步。

source: Cannot execute write queries: TablePro's Safe Mode is set to read-only for this connection
fr: Impossible d'exécuter des requêtes d'écriture : le mode sécurisé de TablePro est réglé en lecture seule pour cette connexion.
ko: 쓰기 쿼리를 실행할 수 없음: 이 연결에 대한 TablePro의 안전 모드가 읽기 전용으로 설정되어 있습니다
tr: Yazma sorguları çalıştırılamıyor: Bu bağlantı için TablePro'nun Safe Mode ayarı salt okunur
vi: Không thể chạy truy vấn ghi: Chế độ an toàn của TablePro đang đặt kết nối này ở chế độ chỉ đọc
zh_hans: 无法执行写入查询：TablePro 的安全模式已将此连接设为只读
zh_hant: 無法執行寫入查詢：TablePro 的安全模式已將此連線設為唯讀

source: Types, sorted by qualified name
fr: Types, triés par nom qualifié

source: %d edited
fr: %d modifié
ko: %d개 편집됨
tr: %d düzenlendi
vi: %d đã sửa
zh_hans: 已编辑 %d 个
zh_hant: 已編輯 %d 個

source: Remove from Folder
fr: Supprimer de la dossier

source: OAuth Client Secret
fr: Secret client OAuth
ko: OAuth 클라이언트 시크릿

source: All Rows (%@)
fr: Toutes les lignes (%@)

source: Rows %lld-%lld
fr: Lignes %lld-%lld
ko: %lld-%lld행
tr: %lld-%lld. satırlar
vi: Hàng %lld-%lld
zh_hans: 第 %lld-%lld 行
zh_hant: 第 %lld-%lld 列

source: Optional, such as http://localhost:8000
fr: Optionnel, comme http://localhost:8000

source: equals
fr: Semble à
ko: 같음
tr: eşittir
vi: bằng
zh_hans: 等于
zh_hant: 等於

source: Schema to search, columns included. Omit to search tables and views in every schema.
fr: Schéma à rechercher, colonnes incluses. Omettre pour rechercher les tables et les vues dans chaque schéma.

source: Nullable
fr: Nulifiable
ko: NULL 허용
vi: Cho phép NULL
zh_hans: 允许 NULL
zh_hant: 允許 NULL

source: The session and its conversation are deleted, and can't be restored.
fr: La session et sa conversation sont supprimées et ne peuvent pas être restaurées.

source: Source column on the left, destination on the right.
fr: Colonne source à gauche, destination à droite.

source: CLR Type
fr: Type CLR

source: Whether the row limit clipped the result
fr: Que la limite de rang a-t-elle coupé le résultat ?
ko: 행 제한 때문에 결과가 잘렸는지 여부
tr: Satır sınırının sonucu kırpıp kırpmadığı
vi: Giới hạn dòng có cắt bớt kết quả hay không
zh_hans: 行数上限是否截断了结果
zh_hant: 列數上限是否截斷了結果

source: ElastiCache IAM authentication requires TLS. Enable SSL in the connection's SSL settings.
fr: L'authentification ElastiCache IAM nécessite TLS. Activez SSL dans les paramètres SSL de la connexion.
ko: ElastiCache IAM 인증에는 TLS가 필요합니다. 연결의 SSL 설정에서 SSL을 활성화하십시오.
tr: ElastiCache IAM kimlik doğrulaması TLS gerektirir. Bağlantının SSL ayarlarından SSL'i etkinleştirin.
vi: Xác thực IAM của ElastiCache yêu cầu TLS. Hãy bật SSL trong cài đặt SSL của kết nối.
zh_hans: ElastiCache IAM 认证需要 TLS。请在连接的 SSL 设置中启用 SSL。
zh_hant: ElastiCache IAM 驗證需要 TLS。請在連線的 SSL 設定中啟用 SSL。

source: Sentinel
fr: Drapeau
ko: 센티널
zh_hans: 哨兵
zh_hant: 哨兵

source: Connection Not Found
fr: Connexion non trouvée
ko: 연결을 찾을 수 없음
tr: Bağlantı Bulunamadı
vi: Không tìm thấy kết nối
zh_hans: 未找到连接
zh_hant: 找不到連線

source: No activity matches the current filters.
fr: Aucune activité ne correspond aux filtres actuels.
ko: 현재 필터와 일치하는 활동이 없습니다.
tr: Geçerli filtrelerle eşleşen etkinlik yok.
vi: Không có hoạt động nào khớp với bộ lọc hiện tại.
zh_hans: 没有与当前筛选条件匹配的活动。
zh_hant: 沒有符合目前篩選條件的活動。

# Plugin not loaded: %@. %@
source: Plugin not loaded: %1$@. %2$@
fr: Plugin non chargé : %1$@. %2$@
ko: 플러그인이 로드되지 않음: %1$@. %2$@
tr: Eklenti yüklenmedi: %1$@. %2$@
vi: Plugin chưa được tải: %1$@. %2$@
zh_hans: 插件未加载：%1$@。%2$@
zh_hant: 外掛未載入：%1$@。%2$@

source: Retry Install
fr: Réessayer l'installation
ko: 설치 재시도
tr: Kurulumu Yeniden Dene
vi: Thử cài đặt lại
zh_hans: 重试安装
zh_hant: 重試安裝

source: No schemas match "%@"
fr: Aucun schéma ne correspond à "%@"
ko: "%@"과 일치하는 스키마 없음
vi: Không có schema khớp "%@"
zh_hans: 没有匹配 "%@" 的 Schema
zh_hant: 沒有符合「%@」的綱要

source: Preview Query
fr: Prévisualisation de la requête
ko: 쿼리 미리보기
tr: Sorguyu Önizle
vi: Xem trước truy vấn
zh_hans: 预览查询
zh_hant: 預覽查詢

source: New %@ Connection
fr: Nouvelle connexion %@
ko: 새 %@ 연결
tr: Yeni %@ Bağlantısı
vi: Kết nối %@ mới
zh_hans: 新建%@连接
zh_hant: 新增 %@ 連線

source: Set Value
fr: Valeur définie
ko: 값 설정
tr: Değer Ata
vi: Đặt giá trị
zh_hans: 设置值
zh_hant: 設定值

source: The session is waiting on your answer about a statement. Deleting it cancels the statement and deletes its conversation, which can't be restored.
fr: La session attend votre réponse concernant une déclaration. Sa suppression annule la déclaration et supprime sa conversation, qui ne peut pas être restaurée.

source: Tags
fr: Étiquettes
ko: 태그
tr: Etiketler
vi: Thẻ
zh_hans: 标签
zh_hant: 標籤

source: Choose port automatically
fr: Choisissez le port automatiquement
ko: 포트 자동 선택
tr: Portu otomatik seç
vi: Tự động chọn cổng
zh_hans: 自动选择端口
zh_hant: 自動選擇連接埠

source: Decompression failed with exit status %d
fr: La décompression a échoué avec le statut d'arrêt %d
ko: 종료 상태 %d(으)로 압축 해제에 실패했습니다
tr: Açma %d çıkış koduyla başarısız oldu
vi: Giải nén thất bại với mã thoát %d
zh_hans: 解压失败，退出状态 %d
zh_hant: 解壓縮失敗,結束狀態 %d

source: AWS Region
fr: Région AWS
ko: AWS 리전
tr: AWS Bölgesi
zh_hans: AWS 区域
zh_hant: AWS 區域

source: Sync (Pro)
fr: Synchronisation (Pro)
ko: 동기화 (Pro)
tr: Senkronizasyon (Pro)
vi: Đồng bộ (Pro)
zh_hans: 同步（Pro）
zh_hant: 同步（Pro）

source: Change
fr: Changement
ko: 변경
tr: Değişiklik
vi: Thay đổi
zh_hans: 更改
zh_hant: 變更

source: Max Connections
fr: Maximales connexions
ko: 최대 연결 수
tr: Maks. Bağlantı
vi: Kết nối tối đa
zh_hans: 最大连接数
zh_hant: 最大連線數

source: Filter regions
fr: Filtrer les régions

source: Pro feature
fr: Fonction Pro
ko: Pro 기능
tr: Pro özelliği
vi: Tính năng Pro
zh_hans: Pro 功能
zh_hant: Pro 功能

source: List Routines
fr: Liste des routines
ko: 루틴 목록
tr: Rutinleri Listele
vi: Liệt kê routine
zh_hans: 列出例程
zh_hant: 列出常式

source: Planning: %.3fms
fr: Planification : %.3fms
ko: 계획 수립: %.3fms
tr: Planlama: %.3fms
vi: Lập kế hoạch: %.3fms
zh_hans: 规划: %.3fms
zh_hant: 規劃：%.3fms

source: Distributed SQL, PostgreSQL-compatible
fr: SQL distribué, compatible avec PostgreSQL
ko: PostgreSQL 호환 분산 SQL
tr: Dağıtık SQL, PostgreSQL uyumlu
vi: SQL phân tán, tương thích PostgreSQL
zh_hans: 分布式 SQL，兼容 PostgreSQL
zh_hant: 分散式 SQL，相容 PostgreSQL

source: List Types
fr: Types de listes

source: Distributed SQLite by Turso
fr: SQLite distribué par Turso
ko: Turso의 분산형 SQLite
tr: Turso'dan dağıtık SQLite
vi: SQLite phân tán của Turso
zh_hans: Turso 出品的分布式 SQLite
zh_hant: Turso 推出的分散式 SQLite

source: %lld suggestions available, press Down Arrow to browse
fr: %lld suggestions disponibles, appuyez sur la flèche vers le bas pour parcourir
ko: %lld개 제안 사용 가능, 아래쪽 화살표를 눌러 탐색
tr: %lld öneri var, göz atmak için Aşağı Ok'a basın
vi: Có %lld gợi ý, nhấn Mũi tên Xuống để duyệt
zh_hans: 有 %lld 条建议，按向下箭头键浏览
zh_hant: 有 %lld 條建議，按向下箭頭鍵瀏覽

source: Search queries...
fr: Requêtes de recherche...
ko: 쿼리 검색...
vi: Tìm truy vấn...
zh_hans: 搜索查询...
zh_hant: 搜尋查詢…

source: "%@" will be moved to Trash. You can recover it from there.
fr: «%@» sera déplacé vers la corbeille. Vous pouvez le récupérer là-bas.
ko: "%@" 항목이 휴지통으로 이동됩니다. 휴지통에서 복구할 수 있습니다.
tr: "%@" Çöp Sepeti'ne taşınacak. Oradan geri alabilirsiniz.
vi: "%@" sẽ được chuyển vào Thùng rác. Bạn có thể khôi phục từ đó.
zh_hans: "%@"将被移到废纸篓。您可以从那里恢复它。
zh_hant: 「%@」將被移到垃圾桶。你可以從那裡復原它。

source: Select objects of the same kind to edit their privileges.
fr: Sélectionnez des objets du même type pour modifier leurs privilèges.
ko: 권한을 편집할 같은 종류의 객체를 선택하십시오.
tr: Yetkilerini düzenlemek için aynı türden nesneler seçin.
vi: Chọn các đối tượng cùng loại để sửa quyền của chúng.
zh_hans: 选择同一类型的对象才能编辑它们的权限。
zh_hant: 選擇同一類型的物件才能編輯它們的權限。

source: Schema the trigger belongs to
fr: Schéma à partir duquel le déclencheur appartient
ko: 트리거가 속한 스키마
tr: Tetikleyicinin ait olduğu şema
vi: Schema mà trigger thuộc về
zh_hans: 该触发器所属的 Schema
zh_hant: 該觸發器所屬的綱要

source: Custom guidance the AI sees on every chat turn for this connection. Use it for table conventions, naming, columns to avoid (PII, soft-deleted rows), join hints, or business rules the schema doesn't show.
fr: Guidage personnalisé que l'IA voit à chaque tour de chat pour cette connexion. Utilisez-le pour les conventions de table, les noms, les colonnes à éviter (PII, lignes supprimées doucement), les indices de jointure ou les règles commerciales que le schéma ne montre pas.
ko: 이 연결에서 채팅을 주고받을 때마다 AI에 제공되는 사용자 지정 지침입니다. 테이블 규칙, 명명 규칙, 피해야 할 열(PII, 소프트 삭제된 행), 조인 힌트 또는 스키마에 표시되지 않는 비즈니스 규칙을 입력하십시오.
tr: Bu bağlantı için yapay zekanın her sohbet turunda gördüğü özel yönerge. Tablo kuralları, adlandırma, kaçınılması gereken sütunlar (PII, geçici silinmiş satırlar), join ipuçları veya şemanın göstermediği iş kuralları için kullanın.
vi: Hướng dẫn tùy chỉnh mà AI thấy ở mỗi lượt trò chuyện cho kết nối này. Dùng cho quy ước bảng, cách đặt tên, các cột cần tránh (PII, hàng đã xóa mềm), gợi ý join, hoặc quy tắc nghiệp vụ mà schema không thể hiện.
zh_hans: AI 在此连接的每轮聊天中都会看到的自定义指引。可用于说明表约定、命名规范、应避免的列（PII、软删除行）、联结提示，或 Schema 中未体现的业务规则。
zh_hant: AI 在此連線的每一輪聊天中都會看到的自訂指引。可用於說明資料表慣例、命名規則、應避免的欄位（PII、軟刪除的列）、JOIN 提示，或綱要未顯示的商業規則。

source: 1 item
fr: 1 article

source: Opens the database file on this Mac.
fr: Ouvre le fichier de base de données sur ce Mac.

source: Error: %@
fr: Erreur : %@
ko: 오류: %@
tr: Hata: %@
vi: Lỗi: %@
zh_hans: 错误: %@
zh_hant: 錯誤：%@

source: Sentinel Password
fr: Mot de passe Sentinel
ko: 센티널 암호
tr: Sentinel Parolası
vi: Mật khẩu Sentinel
zh_hans: 哨兵密码
zh_hant: 哨兵密碼

source: Show Next Window Tab
fr: Afficher la prochaine onglet de fenêtre
ko: 다음 윈도우 탭 보기
tr: Sonraki Pencere Sekmesini Göster
vi: Hiện tab cửa sổ tiếp theo
zh_hans: 显示下一个窗口标签页
zh_hant: 顯示下一個視窗分頁

source: No keys
fr: Pas de clés
ko: 키 없음
tr: Anahtar yok
vi: Không có khóa
zh_hans: 没有键
zh_hant: 沒有鍵

source: List
fr: Liste
ko: 목록
tr: Liste
zh_hans: 列表
zh_hant: 清單

source: A row with this key already exists
fr: Une ligne avec cette clé existe déjà.
ko: 이 키를 가진 행이 이미 있습니다
tr: Bu anahtara sahip bir satır zaten var
vi: Đã có dòng với khoá này
zh_hans: 已存在使用此键的行
zh_hant: 已存在使用此鍵的列

source: These connections open their tunnel by running a command on this Mac, every time they connect: %@
fr: Ces connexions ouvrent leur tunnel en exécutant une commande sur ce Mac, chaque fois qu'elles se connectent : %@

source: Every database you picked is written into this folder.
fr: Chaque base de données que vous avez sélectionnée est écrite dans ce dossier.

source: Read from elsewhere
fr: Lire ailleurs

source: This database cannot restore a row with its original key.
fr: Cette base de données ne peut pas restaurer une ligne avec sa clé originale.
ko: 이 데이터베이스는 행을 원래 키로 복원할 수 없습니다.
tr: Bu veritabanı bir satırı özgün anahtarıyla geri yükleyemiyor.
vi: Cơ sở dữ liệu này không thể khôi phục một dòng với khoá gốc của nó.
zh_hans: 此数据库无法用原来的键恢复某一行。
zh_hant: 此資料庫無法用原來的鍵還原某一列。

source: Excel on Windows needs this to read UTF-8. Other readers show it as part of the first value.
fr: Excel sur Windows a besoin de cela pour lire UTF-8. D'autres lecteurs le montrent comme faisant partie de la première valeur.
ko: Windows의 Excel은 UTF-8을 읽으려면 이것이 필요합니다. 다른 리더는 첫 번째 값의 일부로 표시합니다.
tr: Windows'taki Excel, UTF-8 okumak için buna ihtiyaç duyar. Diğer okuyucular bunu ilk değerin parçası olarak gösterir.
vi: Excel trên Windows cần dấu này để đọc UTF-8. Các trình đọc khác hiển thị nó như một phần của giá trị đầu tiên.
zh_hans: Windows 版 Excel 需要它才能读取 UTF-8。其他阅读器会将它显示为第一个值的一部分。
zh_hant: Windows 版 Excel 需要它才能讀取 UTF-8。其他讀取器會將它顯示為第一個值的一部分。

source: Could not build the column reorder for this table. If this engine's driver was installed before column reorder shipped, update it in Settings > Plugins.
fr: Impossible de construire la réorganisation des colonnes pour cette table. Si le pilote de ce moteur a été installé avant l'expédition de la réorganisation des colonnes, veuillez le mettre à jour dans Paramètres > Plugins.

source: App
fr: Application
ko: 앱
tr: Uygulama
vi: Ứng dụng
zh_hans: 应用
